Public Attributes | List of all members
API_OpeningFloorPlanParameters Struct Reference
Element Manager API
Parameters of floor plan and section representation. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_OpeningFloorPlanDisplayModeTypeID  | floorPlanDisplayMode
Floor plan display type.
API_OpeningFloorPlanConnectionModeTypeID  | connectionMode
Floor plan connection mode.
API_OpeningCutSurfacesParameters  | cutSurfacesParameters
Cut surfaces parameters.
API_OpeningOutlinesParameters  | outlinesParameters
Outlines parameters.
API_OpeningCoverFillsParameters  | coverFillsParameters
Cover fills parameters.
API_CoverFillTransformation  | coverFillTransformation
Cover fill transformation.
API_OpeningReferenceAxisParameters  | referenceAxisParameters
Reference axis parameters.
Detailed Description
Parameters of floor plan and section representation.
Member Data Documentation
◆ connectionMode
 API_OpeningFloorPlanParameters::connectionMode
Floor plan connection mode.
◆ coverFillsParameters
 API_OpeningFloorPlanParameters::coverFillsParameters
Cover fills parameters.
◆ coverFillTransformation
 API_OpeningFloorPlanParameters::coverFillTransformation
Cover fill transformation.
◆ cutSurfacesParameters
 API_OpeningFloorPlanParameters::cutSurfacesParameters
Cut surfaces parameters.
◆ floorPlanDisplayMode
 API_OpeningFloorPlanParameters::floorPlanDisplayMode
Floor plan display type.
◆ outlinesParameters
 API_OpeningFloorPlanParameters::outlinesParameters
Outlines parameters.
◆ referenceAxisParameters
 API_OpeningFloorPlanParameters::referenceAxisParameters
Reference axis parameters.